## Створити базу даних database у якій буде три таблички: Table1, Table2, Table3.

In [9]:
import sqlite3 as sql
import pandas as pd

In [10]:
connection = sql.connect('database.sqlite')
cursor = connection.cursor()

## Table1 міститиме:

### первинний ключ ID;

### колонку Vehicle_type;

### колонку Milleage;

### колонку Max_speed;

### колонку Passenger_count;

### колонку Category (можливі категорії транспортного засобу A, B, C).

In [95]:
sql_query = '''
CREATE TABLE IF NOT EXISTS table1(
    `id` INTEGER PRIMARY KEY,
    `vehicle_type` VARCHAR(50),
    `mileage` INTEGER,
    `max_speed` INTEGER,
    `passenger_count` INTEGER,
    `category` VARCHAR(1)
); '''

try:
    cursor.execute(sql_query) 
    connection.commit() 
except Exception as e:
    print(e)
    connection.rollback()

### Метод створення бази даних та заповнення її значеннями не принциповий проте потрібно, щоб було 20 різних значень в цій таблиці. Важливо, щоб було 3 категорії А, 12 категорій В і 5 категорій С. При чому категорії С має відповідати вантажний Vehicle_type, категорії В – легковий, і категорії А відповідно щось типу мотоцикла.

In [12]:
import random

"A" category:

In [98]:

mileage = [random.randint(1, 30)*1000 for n in range(3)]
max_speed = [random.randint(20, 40)*10 for n in range(3)]
passengers_count = [random.randint(0, 1) for n in range(3)]
print(mileage)
print(max_speed)
print(passengers_count)

[24000, 21000, 2000]
[250, 400, 220]
[1, 0, 1]

In [99]:
sql_query = ''' 
INSERT INTO `table1` 
(`vehicle_type`, `mileage`, `max_speed`, `passenger_count`, `category`)
VALUES ("moto", "%s", "%s", "%s", "A" )
'''

In [100]:
try:
    for i in range(3):
        cursor.execute(sql_query%(mileage[i], max_speed[i], passengers_count[i]))
        connection.commit() 
except Exception as e:
    print(e)
    connection.rollback()

"B" category:

In [101]:
mileage = [random.randint(1, 30)*1000 for n in range(12)]
max_speed = [random.randint(20, 37)*10 for n in range(12)]
print(mileage)
print(max_speed)

[2000, 15000, 8000, 13000, 19000, 14000, 16000, 17000, 23000, 1000, 22000, 11000]
[350, 220, 220, 340, 280, 370, 290, 350, 330, 200, 200, 350]

In [102]:
sql_query = ''' 
INSERT INTO `table1` 
(`vehicle_type`, `mileage`, `max_speed`, `passenger_count`, `category`)
VALUES ("auto", "%s", "%s", 4, "B" )
'''

In [103]:
try:
    for i in range(12):
        cursor.execute(sql_query%(mileage[i], max_speed[i])) 
        connection.commit() 
except Exception as e:
    print(e)
    connection.rollback()

"C" category:

In [106]:
mileage = [random.randint(20, 300)*1000 for n in range(5)]
max_speed = [random.randint(10, 16)*10 for n in range(5)]
passenger_count = [random.randint(8, 16) for n in range(5)]
print(mileage)
print(max_speed)
print(passenger_count)

[281000, 54000, 180000, 261000, 21000]
[120, 160, 150, 140, 160]
[15, 16, 9, 16, 10]

In [107]:
sql_query = ''' 
INSERT INTO `table1` 
(`vehicle_type`, `mileage`, `max_speed`, `passenger_count`, `category`)
VALUES ("truck", "%s", "%s", "%s", "C" )
'''

In [108]:
try:
    for i in range(5):
        cursor.execute(sql_query%(mileage[i], max_speed[i], passenger_count[i])) 
        connection.commit() 
except Exception as e:
    print(e)
    connection.rollback()

# Table1

In [109]:
select_query = '''
SELECT *
FROM table1
'''
df_table1 = pd.read_sql_query(select_query, connection)
df_table1

    id vehicle_type  mileage  max_speed  passenger_count category
0    1         moto    24000        250                1        A
1    2         moto    21000        400                0        A
2    3         moto     2000        220                1        A
3    4         auto     2000        350                4        B
4    5         auto    15000        220                4        B
5    6         auto     8000        220                4        B
6    7         auto    13000        340                4        B
7    8         auto    19000        280                4        B
8    9         auto    14000        370                4        B
9   10         auto    16000        290                4        B
10  11         auto    17000        350                4        B
11  12         auto    23000        330                4        B
12  13         auto     1000        200                4        B
13  14         auto    22000        200                4        B
14  15         auto    11000        350                4        B
15  16        truck   281000        120               15        C
16  17        truck    54000        160               16        C
17  18        truck   180000        150                9        C
18  19        truck   261000        140               16        C
19  20        truck    21000        160               10        C

### Table 2 міститиме первинний ключ свій власний, а також чужий ключ з Table 1. Крім цього міститиме колонки з 20-ма різними водіями, тобто колонки Driver_name та Driver_category (можливі категорії транспортного засобу A, B, C). Важливо, що один водій може водити лише один транспортний засіб. 

### При чому потрібно зробити рівно 7 помилкових записів. Тобто водій з категорією В наприклад водить Вантажівку, а водій з категорією А – легковий автомобіль.

In [112]:
sql_query = '''
CREATE TABLE IF NOT EXISTS table2(
    `id` INTEGER PRIMARY KEY,
    `id_vehicle` INTEGER FOREIGH KEY REFERENCES `table1`(`id`) ON DELETE CASCADE,
    `driver_name` VARCHAR(50),
    `driver_category` VARCHAR(1)
); '''

In [113]:
try:
    cursor.execute(sql_query) 
    connection.commit() 
except Exception as e:
    print(e)
    connection.rollback()

In [261]:
pip install names

Collecting names
  Downloading names-0.3.0.tar.gz (789 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 789.1/789.1 kB 5.4 MB/s eta 0:00:00a 0:00:01
  Preparing metadata (setup.py) ... done
Building wheels for collected packages: names
  Building wheel for names (setup.py) ... done
  Created wheel for names: filename=names-0.3.0-py3-none-any.whl size=803681 sha256=5e3a81981d742fb99568e2b1b3ce388c7fb1fdf05f0be3c07fba63ea7fc89d5e
  Stored in directory: /Users/hanna/Library/Caches/pip/wheels/8d/db/fc/50ec19a89a8dcbbd158a4aae44123cb525cda1f07dae287197
Successfully built names
Installing collected packages: names
Successfully installed names-0.3.0
Note: you may need to restart the kernel to use updated packages.

In [38]:
import names

In [5]:
id_vehicle = [i for i in range(1, 21)]
driver_name = [names.get_full_name() for i in range(20)]
driver_category = ["A"]*5 + ["B"]*7 +["C"]*6 +["B"]*2

print(id_vehicle)
print(driver_name)
print(driver_category)

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20]
['Norberto Fetzer', 'Diane Gross', 'Cleveland Durham', 'Jean Benbow', 'Timothy Johnson', 'Daniel Angarola', 'Kenneth Mclean', 'Jason Scott', 'Charles Harper', 'William Fortner', 'Robert Johnson', 'Dorothy Dessert', 'John Perry', 'Carrol Ohlsen', 'Gary Darby', 'William Vayner', 'Cherie Mcalpin', 'Daniel Hale', 'Tracy Easterling', 'Morgan Beard']
['A', 'A', 'A', 'A', 'A', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'C', 'C', 'C', 'C', 'C', 'C', 'B', 'B']

In [114]:
sql_query = ''' 
INSERT INTO `table2` 
(`id_vehicle`, `driver_name`, `driver_category`)
VALUES ("%s", "%s", "%s")
'''

In [115]:
try:
    for i in range(20):
        cursor.execute(sql_query%(id_vehicle[i], driver_name[i], driver_category[i])) 
        connection.commit() 
except Exception as e:
    print(e)
    connection.rollback()

# Table2

In [116]:
select_query = '''
SELECT *
FROM table2
'''
df_table2 = pd.read_sql_query(select_query, connection)
df_table2

    id  id_vehicle       driver_name driver_category
0    1           1   Norberto Fetzer               A
1    2           2       Diane Gross               A
2    3           3  Cleveland Durham               A
3    4           4       Jean Benbow               A
4    5           5   Timothy Johnson               A
5    6           6   Daniel Angarola               B
6    7           7    Kenneth Mclean               B
7    8           8       Jason Scott               B
8    9           9    Charles Harper               B
9   10          10   William Fortner               B
10  11          11    Robert Johnson               B
11  12          12   Dorothy Dessert               B
12  13          13        John Perry               C
13  14          14     Carrol Ohlsen               C
14  15          15        Gary Darby               C
15  16          16    William Vayner               C
16  17          17    Cherie Mcalpin               C
17  18          18       Daniel Hale               C
18  19          19  Tracy Easterling               B
19  20          20      Morgan Beard               B

### Table 3 міститиме первинний ключ, колонку Category та колонку Permitted_roads (просто якийсь рандомний набір букв та цифр, наприклад CR22, AT12). 10 довільних записів.

In [47]:
sql_query = '''
CREATE TABLE IF NOT EXISTS table3(
    `id` INTEGER PRIMARY KEY,
    `category` VARCHAR(1),
    `permitted_roads` VARCHAR(10)
); '''

In [48]:
try:
    cursor.execute(sql_query) 
    connection.commit() 
except Exception as e:
    print(e)
    connection.rollback()

In [50]:
import string

In [56]:
roads = []
for i in range(10):
    first = random.choice(string.ascii_letters).upper()
    second = random.choice(string.ascii_letters).upper()
    number_1 = random.randint(0,9)
    number_2 = random.randint(0,9)
    name = first + second + str(number_1) + str(number_2)
    roads.append(name)
print(roads)

['OX97', 'GR94', 'YE22', 'JK62', 'YI90', 'WY46', 'FH81', 'DL13', 'FV43', 'NB39']

In [57]:
list_category = ["A"]*2 + ["B"]*4 +["C"]*4
print(list_category)

['A', 'A', 'B', 'B', 'B', 'B', 'C', 'C', 'C', 'C']

In [59]:
sql_query = ''' 
INSERT INTO `table3` 
(`category`, `permitted_roads`)
VALUES ("%s", "%s")
'''

In [60]:
try:
    for i in range(10):
        cursor.execute(sql_query%(list_category[i], roads[i])) 
        connection.commit() 
except Exception as e:
    print(e)
    connection.rollback()

# Table3

In [61]:
select_query = '''
SELECT *
FROM table3
'''
df = pd.read_sql_query(select_query, connection)
df

   id category permitted_roads
0   1        A            OX97
1   2        A            GR94
2   3        B            YE22
3   4        B            JK62
4   5        B            YI90
5   6        B            WY46
6   7        C            FH81
7   8        C            DL13
8   9        C            FV43
9  10        C            NB39

### Написати запит Select, зберегти як датафрейм, та експортувати в csv, чи xlsx файл наступні таблиці:

### Таблиця, яка міститиме лише правильний матчінг водіїв та їх транспортних засобів. Тобто, водії категорії В – лише легкові, категорії А – лише двохколісні, і С – лише вантажні.

In [117]:
select_query = '''
SELECT `driver_name`, `driver_category`, `vehicle_type` FROM `table1` JOIN `table2` ON table2.id_vehicle = table1.id
WHERE table2.driver_category = table1.category;
'''
df_1 = pd.read_sql_query(select_query, connection)
df_1

         driver_name driver_category vehicle_type
0    Norberto Fetzer               A         moto
1        Diane Gross               A         moto
2   Cleveland Durham               A         moto
3    Daniel Angarola               B         auto
4     Kenneth Mclean               B         auto
5        Jason Scott               B         auto
6     Charles Harper               B         auto
7    William Fortner               B         auto
8     Robert Johnson               B         auto
9    Dorothy Dessert               B         auto
10    William Vayner               C        truck
11    Cherie Mcalpin               C        truck
12       Daniel Hale               C        truck

In [67]:
df_1.to_csv("correct_drivers.csv")

### Написати запит Select, зберегти як датафрейм, та експортувати в csv, чи xlsx файл наступні таблиці:
 
### Таблиця, яка міститиме Водіїв, що можуть їздити лише по двох типах доріг. Наприклад, всі водії, які на своєму транспортному засобі можуть їздити по дорозі CR22 та AT12. (При тому, що у водіїв правильна категорія і правильний ТЗ)

In [119]:
select_query = '''
SELECT `driver_name`, `driver_category`, `vehicle_type` FROM `table1` 
JOIN `table2` ON table2.id_vehicle = table1.id
JOIN `table3` ON table3.category = table1.category
WHERE table2.driver_category = table1.category AND table3.permitted_roads = 'OX97' OR table3.permitted_roads = 'GR94'
GROUP BY `driver_name`;
'''
df_2 = pd.read_sql_query(select_query, connection)
df_2

        driver_name driver_category vehicle_type
0  Cleveland Durham               A         moto
1       Diane Gross               A         moto
2   Norberto Fetzer               A         moto

In [79]:
df_2.to_csv("select_roads.csv")

### Потрібно дати дескрайб Table1 у вигляді:

### Яка середня швидкість транспортних засобів по категоріям?

### Який максимальний пробіг по категоріям?

### Яка максимальна швидкість транспортного засобу з кількістю пасажирів більше 8 (якщо такі є)?

In [120]:
select_1 = '''
SELECT AVG(`max_speed`) AS "середня швидкість", `category` AS "категорія" FROM table1 GROUP BY `category`;
'''
df_select1 = pd.read_sql_query(select_1, connection)
df_select1

   середня швидкість категорія
0         290.000000         A
1         291.666667         B
2         146.000000         C

In [121]:
select_2 = '''
SELECT MAX(`mileage`) AS "максимальний пробіг", `category` AS "категорія" FROM table1 GROUP BY `category`;
'''
df_select2 = pd.read_sql_query(select_2, connection)
df_select2

   максимальний пробіг категорія
0                24000         A
1                23000         B
2               281000         C

In [145]:
select_3 = '''
SELECT MAX(`max_speed`) AS "максимальна швидкість" FROM table1 
WHERE `passenger_count` > 8;
'''
cursor.execute(select_3)
max_ = cursor.fetchall()
if max_[0][0] == None:
    print("Не існує транспортного засобу з кількістю пасажирів більше 8")
else:
    print("Mаксимальна швидкість транспортного засобу -", max_[0][0], "км/г")

Mаксимальна швидкість транспортного засобу - 160 км/г